{
  "project": {
    "title": "",
    "author": "",
    "abstract": "",
    "keywords": [],
    "my_article_doi": ""
  },
  "surveys": [
    {
      "id": "https://ieeexplore.ieee.org/document/10036268/references#references",
      "name": "Data-Driven Methods of Machine Learning in modeling the Smart Grids",
      "source": "https://ieeexplore.ieee.org/document/10036268/references#references",
      "date_added": "2026-02-12",
      "total_references_expected": 30,
      "relevance_score": 0.0,
      "articles": [
        {
          "doi": "10.3390/su14052546",
          "title": "Performance Analysis of Machine Learning Algorithms for Energy Demand–Supply Prediction in Smart Grids",
          "authors": [
            "Eric Cebekhulu",
            "Adeiza James Onumanyi",
            "Sherrin John Isaac"
          ],
          "year": 2022,
          "venue": "Sustainability",
          "abstract": "The use of machine learning (ML) algorithms for power demand and supply prediction is becoming increasingly popular in smart grid systems. Due to the fact that there exist many simple ML algorithms/models in the literature, the question arises as to whether there is any significant advantage(s) among these different ML algorithms, particularly as it pertains to power demand/supply prediction use cases. Toward answering this question, we examined six well-known ML algorithms for power prediction in smart grid systems, including the artificial neural network, Gaussian regression (GR), k-nearest neighbor, linear regression, random forest, and support vector machine (SVM). First, fairness was ensured by undertaking a thorough hyperparameter tuning exercise of the models under consideration. As a second step, power demand and supply statistics from the Eskom database were selected for day-ahead forecasting purposes. These datasets were based on system hourly demand as well as renewable generation sources. Hence, when their hyperparameters were properly tuned, the results obtained within the boundaries of the datasets utilized showed that there was little/no significant difference in the quantitative and qualitative performance of the different ML algorithms. As compared to photovoltaic (PV) power generation, we observed that these algorithms performed poorly in predicting wind power output. This could be related to the unpredictable wind-generated power obtained within the time range of the datasets employed. Furthermore, while the SVM algorithm achieved the slightly quickest empirical processing time, statistical tests revealed that there was no significant difference in the timing performance of the various algorithms, except for the GR algorithm. As a result, our preliminary findings suggest that using a variety of existing ML algorithms for power demand/supply prediction may not always yield statistically significant comparative prediction results, particularly for sources with regular patterns, such as solar PV or daily consumption rates, provided that the hyperparameters of such algorithms are properly fine tuned.",
          "crossref_url": "https://doi.org/10.3390/su14052546",
          "google_scholar_url": "https://scholar.google.com/scholar?as_q=Performance+Analysis+of+Machine+Learning+Algorithms+for+Energy+Demand-Supply+Prediction+in+Smart+Grids&as_occt=title&hl=en&as_sdt=0%2C31",
          "ieee_url": "",
          "pdf_url": "",
          "local_path": "",
          "accessed_date": "2026-02-12",
          "relevance_score": 0.0,
          "notes": "",
          "manually_edited": false
        },
        {
          "doi": "10.1142/S0219265921440060",
          "title": "Machine Learning Assisted Energy Optimization in Smart Grid for Smart City Applications",
          "authors": [
            "Ziqiang Tang",
            "Hongping Xie",
            "Changqing Du",
            "Yinying Liu",
            "Osamah Ibrahim Khalaf",
            "Udaya Kumar Allimuthu"
          ],
          "year": 2022,
          "venue": "Journal of Interconnection Networks",
          "abstract": "Peer-to-peer electricity transaction is predicted to play a substantial role in research into future power infrastructures as energy consumption in intelligent microgrids increases. However, the on-demand usage of Energy is a major issue for families to obtain the best cost. This article provides a machine learning predictive power trading framework for supporting distributed power resources in real-time, day-to-day monitoring, and generating schedules. Furthermore, the energy optimization algorithm used in machine learning (EOA-ML) is proposed in this article. The machine learning-based platform suggested two modules: fuel trading and intelligent contracts based on machine learning implemented predictive analytical components. The Blockchain module enables peers to track energy use in real-time, manage electricity trading, model rewards, and irreversible transaction records of electricity trading. A predictive analysis component based on previous power usage data is designed to anticipate short-term energy usage in the Intelligent Contracts. This study utilizes data from the provincial Jeju, Korea’s electricity department on true energy utilization. This study seeks to establish optimal electricity flow and crowdsourced, promoting electricity between consumers and prosumers. Power trading relies on day-to-day, practical environmental control and the planning of decentralized power capitals to satisfy the demands of smart grids. Furthermore, it employs data mining technologies to obtain and study time-series research from the past electricity utilization data. Thus, the time series analytics promotes power controllingto better future efficient planning and managingelectricity supplies. It utilized numerous statistical methods to assess the effectiveness of the suggested prediction model, mean square error in different models of machine learning, recurring neural networks. The efficacy of the proposed system regarding the delay, throughput, and resource using hyperleader caliper is shown. Finally, the suggested approach is successfully applied for power crowdsourcing between prosumer and customer to reach service reliability based on trial findings. The actual and predicted cost analysis has been increased (95%). It minimizes the delay rate to (40.3%) by improving the efficiency rate.",
          "crossref_url": "https://doi.org/10.1142/S0219265921440060",
          "google_scholar_url": "https://scholar.google.com/scholar?as_q=Machine+Learning+Assisted+Energy+Optimization+in+Smart+Grid+for+Smart+City+Applications&as_occt=title&hl=en&as_sdt=0%2C31",
          "ieee_url": "",
          "pdf_url": "",
          "local_path": "",
          "accessed_date": "2026-02-12",
          "relevance_score": 0.0,
          "notes": "",
          "manually_edited": false
        },
        {
          "doi": "10.1016/j.scs.2021.103477",
          "title": "EV-Based reconfigurable smart grid management using support vector regression learning technique machine learning",
          "authors": [
            "Jing Jiang",
            "Laihang Yu",
            "Xiaowei Zhang",
            "Xinhui Ding",
            "Cong Wu"
          ],
          "year": 2022,
          "venue": "Sustainable Cities and Society",
          "abstract": "",
          "crossref_url": "https://doi.org/10.1016/j.scs.2021.103477",
          "google_scholar_url": "https://scholar.google.com/scholar?as_q=EV-+Based+reconfigurable+smart+grid+management+using+support+vector+regression+learning+technique+machine+learning&as_occt=title&hl=en&as_sdt=0%2C31",
          "ieee_url": "",
          "pdf_url": "",
          "local_path": "",
          "accessed_date": "2026-02-12",
          "relevance_score": 0.0,
          "notes": "",
          "manually_edited": false
        },
        {
          "doi": "10.3390/en14238171",
          "title": "A QoS-Aware Machine Learning-Based Framework for AMI Applications in Smart Grids",
          "authors": [
            "Asfandyar Khan",
            "Arif Umar",
            "Arslan Munir",
            "Syed Shirazi",
            "Muazzam Khan",
            "Muhammad Adnan"
          ],
          "year": 2021,
          "venue": "Energies",
          "abstract": "The Internet of things (IoT) enables a diverse set of applications such as distribution automation, smart cities, wireless sensor networks, and advanced metering infrastructure (AMI). In smart grids (SGs), quality of service (QoS) and AMI traffic management need to be considered in the design of efficient AMI architectures. In this article, we propose a QoS-aware machine-learning-based framework for AMI applications in smart grids. Our proposed framework comprises a three-tier hierarchical architecture for AMI applications, a machine-learning-based hierarchical clustering approach, and a priority-based scheduling technique to ensure QoS in AMI applications in smart grids. We introduce a three-tier hierarchical architecture for AMI applications in smart grids to take advantage of IoT communication technologies and the cloud infrastructure. In this architecture, smart meters are deployed over a georeferenced area where the control center has remote access over the Internet to these network devices. More specifically, these devices can be digitally controlled and monitored using simple web interfaces such as REST APIs. We modify the existing K-means algorithm to construct a hierarchical clustering topology that employs Wi-SUN technology for bi-directional communication between smart meters and data concentrators. Further, we develop a queuing model in which different priorities are assigned to each item of the critical and normal AMI traffic based on its latency and packet size. The critical AMI traffic is scheduled first using priority-based scheduling while the normal traffic is scheduled with a first-in–first-out scheduling scheme to ensure the QoS requirements of both traffic classes in the smart grid network. The numerical results demonstrate that the target coverage and connectivity requirements of all smart meters are fulfilled with the least number of data concentrators in the design. Additionally, the numerical results show that the architectural cost is reduced, and the bottleneck problem of the data concentrator is eliminated. Furthermore, the performance of the proposed framework is evaluated and validated on the CloudSim simulator. The simulation results of our proposed framework show efficient performance in terms of CPU utilization compared to a traditional framework that uses single-hop communication from smart meters to data concentrators with a first-in–first-out scheduling scheme.",
          "crossref_url": "https://doi.org/10.3390/en14238171",
          "google_scholar_url": "https://scholar.google.com/scholar?as_q=A+qos-aware+machine+learning-based+framework+for+ami+applications+in+smart+grids&as_occt=title&hl=en&as_sdt=0%2C31",
          "ieee_url": "",
          "pdf_url": "",
          "local_path": "",
          "accessed_date": "2026-02-12",
          "relevance_score": 0.0,
          "notes": "",
          "manually_edited": false
        },
        {
          "doi": "10.3390/electronics10212725",
          "title": "Overview of Signal Processing and Machine Learning for Smart Grid Condition Monitoring",
          "authors": [
            "Elhoussin Elbouchikhi",
            "Muhammad Fahad Zia",
            "Mohamed Benbouzid",
            "Soumia El Hani"
          ],
          "year": 2021,
          "venue": "Electronics",
          "abstract": "Nowadays, the main grid is facing several challenges related to the integration of renewable energy resources, deployment of grid-level energy storage devices, deployment of new usages such as the electric vehicle, massive usage of power electronic devices at different electric grid stages and the inter-connection with microgrids and prosumers. To deal with these challenges, the concept of a smart, fault-tolerant, and self-healing power grid has emerged in the last few decades to move towards a more resilient and efficient global electrical network. The smart grid concept implies a bi-directional flow of power and information between all key energy players and requires smart information technologies, smart sensors, and low-latency communication devices. Moreover, with the increasing constraints, the power grid is subjected to several disturbances, which can evolve to a fault and, in some rare circumstances, to catastrophic failure. These disturbances include wiring issues, grounding, switching transients, load variations, and harmonics generation. These aspects justify the need for real-time condition monitoring of the power grid and its subsystems and the implementation of predictive maintenance tools. Hence, researchers in industry and academia are developing and implementing power systems monitoring approaches allowing pervasive and effective communication, fault diagnosis, disturbance classification and root cause identification. Specifically, a focus is placed on power quality monitoring using advanced signal processing and machine learning approaches for disturbances characterization. Even though this review paper is not exhaustive, it can be considered as a valuable guide for researchers and engineers who are interested in signal processing approaches and machine learning techniques for power system monitoring and grid-disturbance classification purposes.",
          "crossref_url": "https://doi.org/10.3390/electronics10212725",
          "google_scholar_url": "https://scholar.google.com/scholar?as_q=Overview+of+signal+processing+and+machine+learning+for+smart+grid+condition+monitoring&as_occt=title&hl=en&as_sdt=0%2C31",
          "ieee_url": "",
          "pdf_url": "",
          "local_path": "",
          "accessed_date": "2026-02-12",
          "relevance_score": 0.0,
          "notes": "",
          "manually_edited": false
        },
        {
          "doi": "10.1016/j.egyr.2021.07.077",
          "title": "Using machine learning and computer vision to estimate the angular velocity of wind turbines in smart grids remotely",
          "authors": [
            "Mahdi Bahaghighat",
            "Fereshteh Abedini",
            "Qin Xin",
            "Morteza Mohammadi Zanjireh",
            "Seyedali Mirjalili"
          ],
          "year": 2021,
          "venue": "Energy Reports",
          "abstract": "",
          "crossref_url": "https://doi.org/10.1016/j.egyr.2021.07.077",
          "google_scholar_url": "https://scholar.google.com/scholar?as_q=Using+machine+learning+and+computer+vision+to+estimate+the+angular+velocity+of+wind+turbines+in+smart+grids+remotely&as_occt=title&hl=en&as_sdt=0%2C31",
          "ieee_url": "",
          "pdf_url": "",
          "local_path": "",
          "accessed_date": "2026-02-12",
          "relevance_score": 0.0,
          "notes": "",
          "manually_edited": false
        },
        {
          "doi": "10.1007/s40319-021-01100-7",
          "title": "Smart Grids and Machine Learning in Chinese and Western Intellectual Property Law",
          "authors": [
            "Stefan Papastefanou"
          ],
          "year": 2021,
          "venue": "IIC - International Review of Intellectual Property and Competition Law",
          "abstract": "AbstractHaving huge power grids successfully integrate sustainable energy sources requires a smart and flexible power grid management system. Such smart systems have to adapt fast and accurately to a great amount of data input – a task which is made easier by applying modern machine learning technology. Solutions crafted by dynamic and powerful computing algorithms have the potential to surpass human cognitive capabilities. The question arises whether and how intellectual property law can be used to set the right incentives. This paper initially describes the basic functions of smart grids and the corresponding necessity of machine learning. Subsequently, it will analyze the current approaches of the most relevant patent offices in dealing with the challenges of AI-related smart grid inventions. Ultimately, it will be demonstrated that the contemporary discussions fail to focus on practical considerations of market entry possibilities that might be more promising than the approach of creating new exclusionary intellectual property rights.",
          "crossref_url": "https://doi.org/10.1007/s40319-021-01100-7",
          "google_scholar_url": "https://scholar.google.com/scholar?as_q=Smart+Grids+and+Machine+Learning+in+Chinese+and+Western+Intellectual+Property+Law%3A+The+Key+Role+of+Machine+Learning+in+Integrating+Sustainable+Energy+into+Smart+Grids+and+the+Corresponding+Approaches+to+Asset+Protection+in+Intellectual+Property+Law&as_occt=title&hl=en&as_sdt=0%2C31",
          "ieee_url": "",
          "pdf_url": "https://link.springer.com/content/pdf/10.1007/s40319-021-01100-7.pdf",
          "local_path": "bibliography\\pdfs\\10.1007_s40319-021-01100-7.pdf",
          "accessed_date": "2026-02-12",
          "relevance_score": 0.0,
          "notes": "",
          "manually_edited": false
        },
        {
          "doi": "10.1016/j.scs.2021.103071",
          "title": "A stochastic machine learning based approach for observability enhancement of automated smart grids",
          "authors": [
            "Li Min",
            "Khalid Abdulaziz Alnowibet",
            "Adel Fahad Alrasheedi",
            "Farid Moazzen",
            "Emad Mahrous Awwad",
            "Mohamed A. Mohamed"
          ],
          "year": 2021,
          "venue": "Sustainable Cities and Society",
          "abstract": "",
          "crossref_url": "https://doi.org/10.1016/j.scs.2021.103071",
          "google_scholar_url": "https://scholar.google.com/scholar?as_q=A+stochastic+machine+learning+based+approach+for+observability+enhancement+of+automated+smart+grids&as_occt=title&hl=en&as_sdt=0%2C31",
          "ieee_url": "",
          "pdf_url": "",
          "local_path": "",
          "accessed_date": "2026-02-12",
          "relevance_score": 0.0,
          "notes": "",
          "manually_edited": false
        },
        {
          "doi": "10.1016/j.ijepes.2021.106819",
          "title": "Machine learning based false data injection in smart grid",
          "authors": [
            "Rehan Nawaz",
            "Rabbaya Akhtar",
            "Muhammad Awais Shahid",
            "Ijaz Mansoor Qureshi",
            "Muhammad Habib Mahmood"
          ],
          "year": 2021,
          "venue": "International Journal of Electrical Power &amp; Energy Systems",
          "abstract": "",
          "crossref_url": "https://doi.org/10.1016/j.ijepes.2021.106819",
          "google_scholar_url": "https://scholar.google.com/scholar?as_q=Machine+learning+based+false+data+injection+in+smart+grid&as_occt=title&hl=en&as_sdt=0%2C31",
          "ieee_url": "",
          "pdf_url": "",
          "local_path": "",
          "accessed_date": "2026-02-12",
          "relevance_score": 0.0,
          "notes": "",
          "manually_edited": false
        },
        {
          "doi": "10.3390/en14165196",
          "title": "A Machine Learning-Based Gradient Boosting Regression Approach for Wind Power Production Forecasting: A Step towards Smart Grid Environments",
          "authors": [
            "Upma Singh",
            "Mohammad Rizwan",
            "Muhannad Alaraj",
            "Ibrahim Alsaidan"
          ],
          "year": 2021,
          "venue": "Energies",
          "abstract": "In the last few years, several countries have accomplished their determined renewable energy targets to achieve their future energy requirements with the foremost aim to encourage sustainable growth with reduced emissions, mainly through the implementation of wind and solar energy. In the present study, we propose and compare five optimized robust regression machine learning methods, namely, random forest, gradient boosting machine (GBM), k-nearest neighbor (kNN), decision-tree, and extra tree regression, which are applied to improve the forecasting accuracy of short-term wind energy generation in the Turkish wind farms, situated in the west of Turkey, on the basis of a historic data of the wind speed and direction. Polar diagrams are plotted and the impacts of input variables such as the wind speed and direction on the wind energy generation are examined. Scatter curves depicting relationships between the wind speed and the produced turbine power are plotted for all of the methods and the predicted average wind power is compared with the real average power from the turbine with the help of the plotted error curves. The results demonstrate the superior forecasting performance of the algorithm incorporating gradient boosting machine regression.",
          "crossref_url": "https://doi.org/10.3390/en14165196",
          "google_scholar_url": "https://scholar.google.com/scholar?as_q=A+machine+learning-based+gradient+boosting+regression+approach+for+wind+power+production+forecasting%3A+A+step+towards+smart+grid+environments&as_occt=title&hl=en&as_sdt=0%2C31",
          "ieee_url": "",
          "pdf_url": "",
          "local_path": "",
          "accessed_date": "2026-02-12",
          "relevance_score": 0.0,
          "notes": "",
          "manually_edited": false
        },
        {
          "doi": "10.3390/su13052954",
          "title": "Machine Learning-Based Node Characterization for Smart Grid Demand Response Flexibility Assessment",
          "authors": [
            "Rostislav Krč",
            "Martina Kratochvílová",
            "Jan Podroužek",
            "Tomáš Apeltauer",
            "Václav Stupka",
            "Tomáš Pitner"
          ],
          "year": 2021,
          "venue": "Sustainability",
          "abstract": "As energy distribution systems evolve from a traditional hierarchical load structure towards distributed smart grids, flexibility is increasingly investigated as both a key measure and core challenge of grid balancing. This paper contributes to the theoretical framework for quantifying network flexibility potential by introducing a machine learning based node characterization. In particular, artificial neural networks are considered for classification of historic demand data from several network substations. Performance of the resulting classifiers is evaluated with respect to clustering analysis and parameter space of the models considered, while the bootstrapping based statistical evaluation is reported in terms of mean confusion matrices. The resulting meta-models of individual nodes can be further utilized on a network level to mitigate the difficulties associated with identifying, implementing and actuating many small sources of energy flexibility, compared to the few large ones traditionally acknowledged.",
          "crossref_url": "https://doi.org/10.3390/su13052954",
          "google_scholar_url": "https://scholar.google.com/scholar?as_q=Machine+learning-based+node+characterization+for+smart+grid+demand+response+flexibility+assessment&as_occt=title&hl=en&as_sdt=0%2C31",
          "ieee_url": "",
          "pdf_url": "",
          "local_path": "",
          "accessed_date": "2026-02-12",
          "relevance_score": 0.0,
          "notes": "",
          "manually_edited": false
        },
        {
          "doi": "10.1111/exsy.12832",
          "title": "Machine learning‐based model for prediction of power consumption in smart grid‐ smart way towards smart city",
          "authors": [
            "Shamik Tiwari",
            "Anurag Jain",
            "Nada Mohamed Osman Sid Ahmed",
            "Charu",
            "Lulwah M. Alkwai",
            "Alaa Kamal Yousif Dafhalla",
            "Sawsan Ali Saad Hamad"
          ],
          "year": 2021,
          "venue": "Expert Systems",
          "abstract": "AbstractA smart city is an idea that is realized by the computing of a large amount of data collected through sensors, cameras, and other electronic methods to provide services, manage resources and solve daily life problems. The transformation of the conventional grid to a smart grid is one step in the direction towards smart city realization. An electric grid is composed of control stations, generation centres, transformers, communication lines, and distributors, which helps in transferring power from the power station to domestic and commercial consumers. Present electric grids are not smart enough that they can estimate the varying power requirement of the consumer. Also, these conventional grids are not enough robust and scalable. This has become the motivation for shifting from a conventional grid to a smart grid. The smart grid is a kind of power grid, which is robust and adapts itself to the varying needs of the consumer and self‐healing in nature. In this way, the transformation from a conventional grid to a smart grid will help the government to make a smart city. The emergence of machine learning has helped in the prediction of the stability of the grid under the dynamically changing requirement of the consumer. Also, the usage of a variety of sensors will help in the collection of real‐time consumption data. Through machine learning algorithms, we can gain an insight view of the collected data. This has helped the smart grid to convert into a robust smart grid, as this will help in avoiding the situation of failure. In this work, the authors have applied logistic regression, decision tree, support vector machine, linear discriminant analysis, quadratic discriminant analysis, naïve Bayes, random forest, and k‐nearest neighbour algorithms to predict the stability of the grid. The authors have used the smart grid stability dataset freely available on Kaggle to train and test the models. It has been found that a model designed using the support vector machine algorithm has given the most accurate result.",
          "crossref_url": "https://doi.org/10.1111/exsy.12832",
          "google_scholar_url": "https://scholar.google.com/scholar?as_q=Machine+learning-based+model+for+prediction+of+power+consumption+in+smart+grid-+smart+way+towards+smart+city&as_occt=title&hl=en&as_sdt=0%2C31",
          "ieee_url": "",
          "pdf_url": "https://onlinelibrary.wiley.com/doi/pdf/10.1111/exsy.12832",
          "local_path": "",
          "accessed_date": "2026-02-12",
          "relevance_score": 0.0,
          "notes": "",
          "manually_edited": false
        },
        {
          "doi": "10.3390/sym13050826",
          "title": "Machine Learning-Based Intrusion Detection for Achieving Cybersecurity in Smart Grids Using IEC 61850 GOOSE Messages",
          "authors": [
            "Taha Selim Ustun",
            "S. M. Suhail Hussain",
            "Ahsen Ulutas",
            "Ahmet Onen",
            "Muhammad M. Roomi",
            "Daisuke Mashima"
          ],
          "year": 2021,
          "venue": "Symmetry",
          "abstract": "Increased connectivity is required to implement novel coordination and control schemes. IEC 61850-based communication solutions have become popular due to many reasons—object-oriented modeling capability, interoperable connectivity and strong communication protocols, to name a few. However, communication infrastructure is not well-equipped with cybersecurity mechanisms for secure operation. Unlike online banking systems that have been running such security systems for decades, smart grid cybersecurity is an emerging field. To achieve security at all levels, operational technology-based security is also needed. To address this need, this paper develops an intrusion detection system for smart grids utilizing IEC 61850’s Generic Object-Oriented Substation Event (GOOSE) messages. The system is developed with machine learning and is able to monitor the communication traffic of a given power system and distinguish normal events from abnormal ones, i.e., attacks. The designed system is implemented and tested with a realistic IEC 61850 GOOSE message dataset under symmetric and asymmetric fault conditions in the power system. The results show that the proposed system can successfully distinguish normal power system events from cyberattacks with high accuracy. This ensures that smart grids have intrusion detection in addition to cybersecurity features attached to exchanged messages.",
          "crossref_url": "https://doi.org/10.3390/sym13050826",
          "google_scholar_url": "https://scholar.google.com/scholar?as_q=Machine+learning-based+intrusion+detection+for+achieving+cybersecurity+in+smart+grids+using+IEC+61850+GOOSE+messages&as_occt=title&hl=en&as_sdt=0%2C31",
          "ieee_url": "",
          "pdf_url": "",
          "local_path": "",
          "accessed_date": "2026-02-12",
          "relevance_score": 0.0,
          "notes": "",
          "manually_edited": false
        },
        {
          "doi": "10.1080/14786451.2021.1873339",
          "title": "Analysis of classical and machine learning based short-term and mid-term load forecasting for smart grid",
          "authors": [
            "Sneha Rai",
            "Mala De"
          ],
          "year": 2021,
          "venue": "International Journal of Sustainable Energy",
          "abstract": "",
          "crossref_url": "https://doi.org/10.1080/14786451.2021.1873339",
          "google_scholar_url": "https://scholar.google.com/scholar?as_q=Analysis+of+classical+and+machine+learning+based+short-term+and+mid-term+load+forecasting+for+smart+grid&as_occt=title&hl=en&as_sdt=0%2C31",
          "ieee_url": "",
          "pdf_url": "",
          "local_path": "",
          "accessed_date": "2026-02-12",
          "relevance_score": 0.0,
          "notes": "",
          "manually_edited": false
        },
        {
          "doi": "10.1002/sys.21561",
          "title": "System of systems uncertainty quantification using machine learning techniques with smart grid application",
          "authors": [
            "Ali K. Raz",
            "Paul C. Wood",
            "Linas Mockus",
            "Daniel A. DeLaurentis"
          ],
          "year": 2020,
          "venue": "Systems Engineering",
          "abstract": "Abstract\n                  System‐of‐Systems capability is inherently tied to the participation and performance of the constituent systems and the network performance which connects the systems together. It is imperative for the SoS stakeholders to quantify the SoS capability and performance to any uncertain variations in the system participation and network outages so that the system participation is incentivized and network design optimized. However, given the independent operations, management, and objectives of constituent systems, along with an increasing number of systems that collectively become a part of SoS, it becomes difficult to obtain a closed analytical function for SoS performance characterization. In this paper, we investigate and compare two machine learning techniques, Artificial Neural Network and Parametric Bayesian Estimation, to obtain a predictive model of the SoS given the uncertainty in the constituent system participation and the network conditions. We demonstrate our approach on a smart grid SoS application example and describe how the two machine learning techniques enable SoS robustness and resilience analysis by quantifying the uncertainty in the model and SoS operations. The results of smart grid example establish the value of SoS uncertainty quantification (UQ) and show how smart grid operators can utilize UQ models to maintain the desired robustness as operating conditions evolve and how the designers can incorporate low‐cost networks into the SoS while maintaining high performance and resilience.",
          "crossref_url": "https://doi.org/10.1002/sys.21561",
          "google_scholar_url": "https://scholar.google.com/scholar?as_q=System+of+systems+uncertainty+quantification+using+machine+learning+techniques+with+smart+grid+application&as_occt=title&hl=en&as_sdt=0%2C31",
          "ieee_url": "",
          "pdf_url": "https://onlinelibrary.wiley.com/doi/pdf/10.1002/sys.21561",
          "local_path": "",
          "accessed_date": "2026-02-12",
          "relevance_score": 0.0,
          "notes": "",
          "manually_edited": false
        },
        {
          "doi": "10.1016/j.scs.2020.102370",
          "title": "Secure and resilient demand side management engine using machine learning for IoT-enabled smart grid",
          "authors": [
            "Muhammad Babar",
            "Muhammad Usman Tariq",
            "Mian Ahmad Jan"
          ],
          "year": 2020,
          "venue": "Sustainable Cities and Society",
          "abstract": "",
          "crossref_url": "https://doi.org/10.1016/j.scs.2020.102370",
          "google_scholar_url": "https://scholar.google.com/scholar?as_q=Secure+and+resilient+demand+side+management+engine+using+machine+learning+for+IoT-enabled+smart+grid&as_occt=title&hl=en&as_sdt=0%2C31",
          "ieee_url": "",
          "pdf_url": "",
          "local_path": "",
          "accessed_date": "2026-02-12",
          "relevance_score": 0.0,
          "notes": "",
          "manually_edited": false
        },
        {
          "doi": "10.1016/j.cose.2020.101994",
          "title": "Detecting stealthy false data injection attacks in the smart grid using ensemble-based machine learning",
          "authors": [
            "Mohammad Ashrafuzzaman",
            "Saikat Das",
            "Yacine Chakhchoukh",
            "Sajjan Shiva",
            "Frederick T. Sheldon"
          ],
          "year": 2020,
          "venue": "Computers &amp; Security",
          "abstract": "",
          "crossref_url": "https://doi.org/10.1016/j.cose.2020.101994",
          "google_scholar_url": "https://scholar.google.com/scholar?as_q=Detecting+stealthy+false+data+injection+attacks+in+the+smart+grid+using+ensemble-based+machine+learning&as_occt=title&hl=en&as_sdt=0%2C31",
          "ieee_url": "",
          "pdf_url": "",
          "local_path": "",
          "accessed_date": "2026-02-12",
          "relevance_score": 0.0,
          "notes": "",
          "manually_edited": false
        },
        {
          "doi": "10.1504/IJRIS.2020.104991",
          "title": "Machine learning methods against false data injection in smart grid",
          "authors": [
            "Mohamed Hamlich",
            "Abdelkarim El Khantach",
            "Noureddine Belbounaguia"
          ],
          "year": 2020,
          "venue": "International Journal of Reasoning-based Intelligent Systems",
          "abstract": "",
          "crossref_url": "https://doi.org/10.1504/IJRIS.2020.104991",
          "google_scholar_url": "https://scholar.google.com/scholar?as_q=Machine+learning+methods+against+false+data+injection+in+smart+grid&as_occt=title&hl=en&as_sdt=0%2C31",
          "ieee_url": "",
          "pdf_url": "",
          "local_path": "",
          "accessed_date": "2026-02-12",
          "relevance_score": 0.0,
          "notes": "",
          "manually_edited": false
        },
        {
          "doi": "10.3390/pr7120870",
          "title": "Using Real-Time Electricity Prices to Leverage Electrical Energy Storage and Flexible Loads in a Smart Grid Environment Utilizing Machine Learning Techniques",
          "authors": [
            "Moataz Sheha",
            "Kody Powell"
          ],
          "year": 2019,
          "venue": "Processes",
          "abstract": "With exposure to real-time market pricing structures, consumers would be incentivized to invest in electrical energy storage systems and smart predictive automation of their home energy systems. Smart home automation through optimizing HVAC (heating, ventilation, and air conditioning) temperature set points, along with distributed energy storage, could be utilized in the process of optimizing the operation of the electric grid. Using electricity prices as decision variables to leverage electrical energy storage and flexible loads can be a valuable tool to optimize the performance of the power grid and reduce electricity costs both on the supply and demand sides. Energy demand prediction is important for proper allocation and utilization of the available resources. Manipulating energy prices to leverage storage and flexible loads through these demand prediction models is a novel idea that needs to be studied. In this paper, different models for proactive prediction of the energy demand for an entire city using different machine learning techniques are presented and compared. The results of the machine learning techniques show that the proposed nonlinear autoregressive with exogenous inputs neural network model resulted in the most accurate predictions. These prediction models pave the way for the demand side to become an important asset for grid regulation by responding to variable price signals through battery energy storage and passive thermal energy storage using HVAC temperature set points.",
          "crossref_url": "https://doi.org/10.3390/pr7120870",
          "google_scholar_url": "https://scholar.google.com/scholar?as_q=Using+real-time+electricity+prices+to+leverage+electrical+energy+storage+and+flexible+loads+in+a+smart+grid+environment+utilizing+machine+learning+techniques&as_occt=title&hl=en&as_sdt=0%2C31",
          "ieee_url": "",
          "pdf_url": "",
          "local_path": "",
          "accessed_date": "2026-02-12",
          "relevance_score": 0.0,
          "notes": "",
          "manually_edited": false
        },
        {
          "doi": "10.1109/TIFS.2019.2902822",
          "title": "Unsupervised Machine Learning-Based Detection of Covert Data Integrity Assault in Smart Grid Networks Utilizing Isolation Forest",
          "authors": [
            "Saeed Ahmed",
            "Youngdoo Lee",
            "Seung-Ho Hyun",
            "Insoo Koo"
          ],
          "year": 2019,
          "venue": "IEEE Transactions on Information Forensics and Security",
          "abstract": "",
          "crossref_url": "",
          "google_scholar_url": "https://scholar.google.com/scholar?as_q=Unsupervised+Machine+Learning-Based+Detection+of+Covert+Data+Integrity+Assault+in+Smart+Grid+Networks+Utilizing+Isolation+Forest&as_occt=title&hl=en&as_sdt=0%2C31",
          "ieee_url": "/document/8660426",
          "pdf_url": "",
          "local_path": "",
          "accessed_date": "2026-02-12",
          "relevance_score": 0.0,
          "notes": "",
          "manually_edited": false
        },
        {
          "doi": "10.1166/jctn.2019.8254",
          "title": "Intrusion Detection in Smart Grid Using Machine Learning Approach",
          "authors": [
            "Anzar Iqbal",
            "Pooja"
          ],
          "year": 2019,
          "venue": "Journal of Computational and Theoretical Nanoscience",
          "abstract": "One among the most unpredictable cyber physical systems accessible around the globe is Smart Grid. The fundamental motivation behind smart grid is to utilize transmission alongside distribution framework to keep up satisfactory stream of power from generation systems to end clients.\n The disturbances in power are exceptionally erratic on account of the utilization of different characteristic and man-made sources. Control administrator are for the most part dependent on the unsettling influences of power system for their response and after that make specific response based\n on these occasions. Humans can’t identify the different cyber-attacks over the power frameworks, since attackers are sufficiently brilliant to cover the tracks. To recognize the different cyber-attacks and separating different power system aggravations, Machine learning is an improving\n method utilized and consequently people, using this strategy, can make better decisions regarding the cause for power disturbances by focusing mainly on the cyber-attacks. Therefore, we investigate different Machine learning strategies as a methods for Detection and classification of these\n attacks and furthermore examine practical utilization of these procedures as an improvement to past power system architectures.",
          "crossref_url": "https://doi.org/10.1166/jctn.2019.8254",
          "google_scholar_url": "https://scholar.google.com/scholar?as_q=Pooja+Intrusion+detection+in+smart+grid+using+machine+learning+approach&as_occt=title&hl=en&as_sdt=0%2C31",
          "ieee_url": "",
          "pdf_url": "",
          "local_path": "",
          "accessed_date": "2026-02-12",
          "relevance_score": 0.0,
          "notes": "",
          "manually_edited": false
        },
        {
          "doi": "10.1016/j.energy.2018.07.084",
          "title": "Potential of three variant machine-learning models for forecasting district level medium-term and long-term energy demand in smart grid environment",
          "authors": [
            "Tanveer Ahmad",
            "Huanxin Chen"
          ],
          "year": 2018,
          "venue": "Energy",
          "abstract": "",
          "crossref_url": "https://doi.org/10.1016/j.energy.2018.07.084",
          "google_scholar_url": "https://scholar.google.com/scholar?as_q=Potential+of+three+variant+machine-learning+models+for+forecasting+district+level+medium-term+and+long-term+energy+demand+in+smart+grid+environment&as_occt=title&hl=en&as_sdt=0%2C31",
          "ieee_url": "",
          "pdf_url": "",
          "local_path": "",
          "accessed_date": "2026-02-12",
          "relevance_score": 0.0,
          "notes": "",
          "manually_edited": false
        },
        {
          "doi": "10.3390/app8050772",
          "title": "Covert Cyber Assault Detection in Smart Grid Networks Utilizing Feature Selection and Euclidean Distance-Based Machine Learning",
          "authors": [
            "Saeed Ahmed",
            "YoungDoo Lee",
            "Seung-Ho Hyun",
            "Insoo Koo"
          ],
          "year": 2018,
          "venue": "Applied Sciences",
          "abstract": "Communications technologies are an integral part of efficient monitoring and reliable control in smart grids, but enhanced reliance on these technologies heightens the risk of cyber assaults. Recently, a new type of stealth, or covert, assault in smart grid networks has been discovered, which cannot be ascertained by legacy bad-data detectors using state estimation. Due to the delay-sensitive nature of smart grid networks, swift detection of abnormal changes is immensely desired. In this paper, we propose two Euclidean distance-based anomaly detection schemes for covert cyber-assault detection in smart grid communications networks. The first scheme utilizes unsupervised-learning over unlabeled data to detect outliers or deviations in the measurements. The second scheme employs supervised-learning over labeled data to detect the deviations in the measurements. Unlike the classic detection test, the proposed schemes tackle an unknown sample with low computational complexity, leading to a shorter decision time. To improve detection accuracy and further reduce the computational complexity and the associated time delay, we employ a genetic algorithm-based feature selection method to choose the distinguishing optimal feature data subset as input to both of the proposed schemes. The evaluation is carried out through the standard IEEE 14-bus, 39-bus, 57-bus and 118-bus test systems. Simulation results show that compared to the existing feature extraction-based detection schemes, the proposed schemes show significant improvement in covert cyber deception assault-detection accuracy.",
          "crossref_url": "https://doi.org/10.3390/app8050772",
          "google_scholar_url": "https://scholar.google.com/scholar?as_q=Covert+cyber+assault+detection+in+smart+grid+networks+utilizing+feature+selection+and+Euclidean+distance-based+machine+learning&as_occt=title&hl=en&as_sdt=0%2C31",
          "ieee_url": "",
          "pdf_url": "",
          "local_path": "",
          "accessed_date": "2026-02-12",
          "relevance_score": 0.0,
          "notes": "",
          "manually_edited": false
        },
        {
          "doi": "10.1109/ACCESS.2018.2835527",
          "title": "Feature Selection–Based Detection of Covert Cyber Deception Assaults in Smart Grid Communications Networks Using Machine Learning",
          "authors": [
            "Saeed Ahmed",
            "Youngdoo Lee",
            "Seung-Ho Hyun",
            "Insoo Koo"
          ],
          "year": 2018,
          "venue": "IEEE Access",
          "abstract": "",
          "crossref_url": "",
          "google_scholar_url": "https://scholar.google.com/scholar?as_q=Feature+Selection-Based+Detection+of+Covert+Cyber+Deception+Assaults+in+Smart+Grid+Communications+Networks+Using+Machine+Learning&as_occt=title&hl=en&as_sdt=0%2C31",
          "ieee_url": "/document/8357769",
          "pdf_url": "",
          "local_path": "",
          "accessed_date": "2026-02-12",
          "relevance_score": 0.0,
          "notes": "",
          "manually_edited": false
        },
        {
          "doi": "10.1109/JSYST.2014.2341597",
          "title": "Detecting Stealthy False Data Injection Using Machine Learning in Smart Grid",
          "authors": [
            "Mohammad Esmalifalak",
            "Lanchao Liu",
            "Nam Nguyen",
            "Rong Zheng",
            "Zhu Han"
          ],
          "year": 2017,
          "venue": "IEEE Systems Journal",
          "abstract": "",
          "crossref_url": "",
          "google_scholar_url": "https://scholar.google.com/scholar?as_q=Detecting+stealthy+false+data+injection+using+machine+learning+in+smart+grid&as_occt=title&hl=en&as_sdt=0%2C31",
          "ieee_url": "/document/6880823",
          "pdf_url": "",
          "local_path": "",
          "accessed_date": "2026-02-12",
          "relevance_score": 0.0,
          "notes": "",
          "manually_edited": false
        },
        {
          "doi": "10.3390/en9090691",
          "title": "Securing Metering Infrastructure of Smart Grid: A Machine Learning and Localization Based Key Management Approach",
          "authors": [
            "Imtiaz Parvez",
            "Arif Sarwat",
            "Longfei Wei",
            "Aditya Sundararajan"
          ],
          "year": 2016,
          "venue": "Energies",
          "abstract": "In smart cities, advanced metering infrastructure (AMI) of the smart grid facilitates automated metering, control and monitoring of power distribution by employing a wireless network. Due to this wireless nature of communication, there exist potential threats to the data privacy in AMI. Decoding the energy consumption reading, injecting false data/command signals and jamming the networks are some hazardous measures against this technology. Since a smart meter possesses limited memory and computational capability, AMI demands a light, but robust security scheme. In this paper, we propose a localization-based key management system for meter data encryption. Data are encrypted by the key associated with the coordinate of the meter and a random key index. The encryption keys are managed and distributed by a trusted third party (TTP). Localization of the meter is proposed by a method based on received signal strength (RSS) using the maximum likelihood estimator (MLE). The received packets are decrypted at the control center with the key mapped with the key index and the meter’s coordinates. Additionally, we propose the k-nearest neighbors (kNN) algorithm for node/meter authentication, capitalizing further on data transmission security. Finally, we evaluate the security strength of a data packet numerically for our method.",
          "crossref_url": "https://doi.org/10.3390/en9090691",
          "google_scholar_url": "https://scholar.google.com/scholar?as_q=Securing+Metering+Infrastructure+of+Smart+Grid%3A+A+Machine+Learning+and+Localization+Based+Key+Management+Approach&as_occt=title&hl=en&as_sdt=0%2C31",
          "ieee_url": "",
          "pdf_url": "",
          "local_path": "",
          "accessed_date": "2026-02-12",
          "relevance_score": 0.0,
          "notes": "",
          "manually_edited": false
        },
        {
          "doi": "10.1109/TNNLS.2015.2404803",
          "title": "Machine Learning Methods for Attack Detection in the Smart Grid",
          "authors": [
            "Mete Ozay",
            "Inaki Esnaola",
            "Fatos Tunay Yarman Vural",
            "Sanjeev R. Kulkarni",
            "H. Vincent Poor"
          ],
          "year": 2016,
          "venue": "IEEE Transactions on Neural Networks and Learning Systems",
          "abstract": "",
          "crossref_url": "",
          "google_scholar_url": "https://scholar.google.com/scholar?as_q=Machine+Learning+Methods+for+Attack+Detection+in+the+Smart+Grid&as_occt=title&hl=en&as_sdt=0%2C31",
          "ieee_url": "/document/7063894",
          "pdf_url": "",
          "local_path": "",
          "accessed_date": "2026-02-12",
          "relevance_score": 0.0,
          "notes": "",
          "manually_edited": false
        },
        {
          "doi": "10.1109/TSG.2015.2442837",
          "title": "A Machine Learning Approach to Meter Placement for Power Quality Estimation in Smart Grid",
          "authors": [
            "Sardar Ali",
            "Kui Wu",
            "Kyle Weston",
            "Dimitri Marinakis"
          ],
          "year": 2016,
          "venue": "IEEE Transactions on Smart Grid",
          "abstract": "",
          "crossref_url": "",
          "google_scholar_url": "https://scholar.google.com/scholar?as_q=Machine+Learning+Approach+to+Meter+Placement+for+Power+Quality+Estimation+in+Smart+Grid&as_occt=title&hl=en&as_sdt=0%2C31",
          "ieee_url": "/document/7152975",
          "pdf_url": "",
          "local_path": "",
          "accessed_date": "2026-02-12",
          "relevance_score": 0.0,
          "notes": "",
          "manually_edited": false
        }
      ]
    }
  ]
}
